{
    "type": {
        "START": 0,
        "STORY": 1,
        "CHOICE": 2,
        "COMBAT": 3,
        "ABILITY_CHECK": 4,
        "END": 5
    },
    "dialogues": [
        {
            "id": "start",
            "text": "",
            "type": 0,
            "nextID": "prolog1",
            "choices": []
        },
        {
            "id": "end",
            "text": "",
            "type": 5,
            "nextID": "",
            "choices": []
        },
        {
            "id": "prolog1",
            "text": "Рыцари всегда занимали особое место в сердцах людей. Они были героями и защитниками народа, ведь они не боялись подвергать свои жизни опасности, чтобы спасти невинных и защитить слабых. Они представляли собой символ отваги и могущества, сражались с самыми страшными существами, и отправлялись в самые опасные путешествия.",
            "type": 1,
            "nextID": "prolog2",
            "choices": []
        },
        {
            "id": "prolog2",
            "text": "Рыцари не боялись вступать в битву с драконами, которые грозили их деревням и городам. И они безукоризненно следовали своим принципам, чтобы спасти принцесс, которых пытались украсть злые властители.",
            "type": 1,
            "nextID": "prolog3",
            "choices": []
        },
        {
            "id": "prolog3",
            "text": "Добро пожаловать в мир Рыцарей! Мечтаешь ли ты стать рыцарем и защищать свою страну от зла или же ищешь славы и богатства, все это достанется тебе, если ты станешь рыцарем! Отправляйся в столицу, чтобы стать оруженосцем и начать обучение рыцарству. Но твой путь не будет легким, и ты встретишь разные препятствия, которые предстоит преодолеть. Готов ли ты к этому путешествию и стать настоящим рыцарем?",
            "type": 2,
            "nextID": "",
            "choices": [
                {"text": "В путь.", "nextID": "chapter1_1"},
                {"text": "Пойти работать на поле.", "nextID": "end"}
            ]
        },
        {
            "id": "chapter1_1",
            "text": "Деревня в который в ты живешь, небольшая и уютная. Распложенная в уединенном месте, вдали от столицы. Дома в деревне выстроены из дерева и окружены большими садами, где растут фрукты и овощи. Жизнь в деревне тихая и спокойная. На главной площади находится фонтан, вокруг которого собираются жители деревни в свободное время.",
            "type": 1,
            "nextID": "chapter1_2",
            "choices": []
        },
        {
            "id": "chapter1_2",
            "text": "Жители дружелюбные и заботливые, они всегда готовы прийти на помощь в несложных делах. Услышав что ты уходишь из деревни, люди собрались на площади что бы проводить тебя.",
            "type": 1,
            "nextID": "chapter1_3",
            "choices": []
        },
        {
            "id": "chapter1_3",
            "text": "Староста выходит вперед что бы отдать тебе провизию которую они собрали и спрашивает тебя.\nТы уже выбрал каким путем пойдешь?",
            "type": 2,
            "nextID": "",
            "choices": [
                {"text": "Через поле, хочу добраться по скорее в столицу", "nextID": "end"},
                {"text": "Выйду на тракт, и попробую добраться вместе с проходящими повозками.", "nextID": "end"}
            ]
        }
    ]
}
